import React from 'react';
import Image from 'next/image';

interface ServiceModalProps {
  onClose: () => void;
}

const ServiceModal: React.FC<ServiceModalProps> = ({ onClose }) => {
  return (
    <div className="fixed inset-0 bg-white z-50 overflow-auto z-[99999]">
      <div className="mx-auto w-[90%] mb-[100px] lg:max-w-[640px] lg:mb-[20px]">
        <div className="flex items-center mb-4">
          <Image
            src="/sign/leftArrow.svg"
            alt="Back"
            width={24}
            height={24}
            onClick={onClose}
            className="cursor-pointer mt-4 mb-8"
          />
        </div>
        <h3 className="text-xl font-bold mb-4">서비스 이용약관 동의</h3>

        <div className="text-sm space-y-4">
          <h4 className="font-bold">제1조 목적</h4>
          <p>
            이 약관은 모아 가이드(이하 “회사”)가 모아가이드 웹사이트 www.moaguide.com(이하 “사이트”)를 통하여 제공하는 서비스(이하 “서비스”)의 이용에 관한 기본적인 사항의 규정을 목적으로 합니다.
          </p>

          <h4 className="font-bold">제2조 용어의 정의</h4>
          <p>
            이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
            <ul className="list-disc list-inside mt-2">
              <li>회원: 회사에 정보를 제공하여 회원 등록을 한 사람으로서 다음 중 어느 하나에 속하는 사람</li>
              <div>(1) 개인회원 : 개인정보를 제공하여 회원 등록을 한 사람으로서 금융기관, 자문회사, 신용기관, 거래소(유사 거래시설 포함), 정부기관, 감독기관, 전문 협회 및 기타 이와 유사한 속성의 기관에 소속되지 않은 사람</div>
              <div>(2) 법인회원 : 사업자 정보를 제공하여 회원 등록을 한 법인의 임직원으로서 관리자 및 서비스 이용 라이선스를 부여 받은 사람</div>
              <li>서비스: 회사가 웹, 모바일(모바일 웹, 스마트폰/태블릿 어플리케이션 등)을 통해 제공하는 모든 서비스</li>
              <li>월 구독: 월 정기 결제 또는 이용권 구매를 통해 약정한 기간 동안 서비스를 이용하는 것</li>
              <li>구독회원권: 멤버십 서비스를 약정한 기간 동안 이용할 수 있는 권한</li>
              <li>구독: 서비스 이용을 위해 지불 수단을 택하여 회원의 금융 정보를 입력하고 승인하는 행위</li>
              <li>구독 취소: 회원이 결제한 이후에 일정한 절차에 따라 결제 행위를 철회하는 것</li>
              <li>결제대행 업체: 회사와 계약 관계에 있는 전자 지불 결제대행사(PG)</li>
            </ul>
          </p>

          <h4 className="font-bold">제3조 약관의 효력과 변경</h4>
          <p>
            1. 이 약관의 내용은 온라인상의 공지, 전자우편 등을 통한 회원 공지를 통해 효력이 발생합니다.
          </p>
          <p>
            2. 회사는 콘텐츠산업 진흥법, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계 법령을 위배하지 않는 범위에서 약관을 변경할 수 있습니다. 회사는 변경된 약관을 제1항과 같은 방식으로 회원에게 통지하며, 별도로 정하지 않는 한 회원이 변경된 약관을 통지받은 때부터 효력이 발생합니다.
          </p>
          <p>
            3. 회원이 변경된 약관에 동의하지 않을 경우, 가입 탈퇴를 요청할 수 있습니다. 명시적으로 동의 철회 의사를 표시하지 않는 경우는 회원이 개정 약관에 동의한 것으로 간주합니다.
          </p>

          <h4 className="font-bold">제4조 약관의 해석</h4>
          <p>
            이 약관에 명시되지 않은 사항은 온라인 디지털콘텐츠산업 발전법, 전자상거래 등에서의 소비자보호에 관한 법률, 약관의 규제 등에 관한 법률 등 관련법과 회사의 회원 약관 및 개인정보 취급 방침, 또는 상관례에 따릅니다.
          </p>

          <h4 className="font-bold">제5조 이용 계약의 체결</h4>
          <p>
            1. 이용 계약은 회원이 되고자 하는 자가 약관의 내용에 대하여 동의를 하고 회원 가입 신청을 한 후 회사가 이러한 신청에 대하여 승낙함으로써 체결됩니다.
          </p>
          <p>
            2. 유료 서비스 이용을 위한 결제 정보 입력란은 해당 서비스의 이용 요금을 지불할 금융 정보이므로 회원이 타인의 정보를 도용하거나 타인의 금융 정보를 임의로 기재해서는 안 되며, 그 경우 모든 책임은 도용자에게 있습니다.
          </p>
          <p>
            3. 서비스 이용을 위해 회사는 결제대행 업체의 결제대행 시스템을 이용할 수 있습니다. 결제대행 시스템을 이용하여 회원이 결제하는 경우 해당 거래에 대한 대금 지급 및 이용에 관한 사항은 결제대행 업체의 약관에 따르며, 이 약관은 세부 결제 페이지에서 확인할 수 있습니다.
          </p>
          <p>
            4. 회사는 다음에 해당하는 경우 회원의 서비스 이용 신청을 승낙하지 않거나 유보할 수 있습니다.
            <ul className="list-disc list-inside mt-2">
              <li>타인의 명의를 도용하여 서비스를 신청, 결제 및 이용한 경우</li>
              <li>서비스 이용 신청서의 내용을 허위로 기재하거나 이용 신청서에 내용을 기재하지 않은 경우</li>
              <li>미성년 회원이 미성년에게 이용이 금지된 서비스에 대하여 이용 신청을 할 경우</li>
              <li>서비스 관련 설비에 여유가 없거나 기술상 지장이 있는 경우</li>
            </ul>
          </p>

          <h4 className="font-bold">제6조 개인정보 보호 정책</h4>
          <p>
          1. 회사는 회원의 개인정보를 보호하며, 개인정보보호법 및 관계 법령을 준수하고 있습니다. 회사는 개인정보처리방침을 통하여 회원이 제공하는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며 개인정보보호를 위해 어떠한 조치를 취하고 있는지 게시하고 있습니다.
          </p>
          <p>
          2. 회사는 회원의 동의를 얻어 수집한 개인정보를 타인에게 누설할 수 없으며, 서비스 제공 목적 이외의 용도로 사용하지 않습니다. 다만 회사가 정보통신망 이용촉진 및 정보보호 등에 관한 법률결제 및 개인정보의 제공을 하도록 요청 받은 경우에는, 회사는 관련 법령에 따라 해당 정보를 필요한 범위 내에서 요청 기관에 제공할 수 있습니다.
          </p>

          <h4 className="font-bold">제7조 회사의 의무</h4>
          <p>
          1. 회사는 이 약관에서 정한 바에 따라 계속적이고 안정적인 서비스의 제공을 위하여 지속적으로 노력합니다. 다만, 긴급한 시스템 점검 및 교체, 천재지변 또는 합리적인 사유로 부득이한 경우에는 서비스를 일시 중단할 수 있습니다. 이런 경우 회사는 사전 또는 사후 이를 공지합니다.
          </p>
          <p>
            2. 콘텐츠 제공업체 또는 저작권자의 요청으로 인하여 콘텐츠의 제공이 일부 제한되거나 변경될 수 있습니다.
          </p>

          <h4 className="font-bold">제8조 회원의 의무</h4>
          <p>
            1. 회원은 자신의 ID(이메일 주소)와 비밀번호를 관리할 의무가 있으며, 이와 관련하여 회원의 귀책사유로 말미암아 발생하는 모든 결과에 대한 책임은 회원에게 있습니다. 회원은 자신의 ID(이메일 주소)와 비밀번호를 제3자에게 이용하도록 해서는 안 됩니다. 제3자가 본인의 ID(이메일 주소)를 사용하고 있음을 인지한 경우에는 해당 회원은 바로 회사에 통보해야 하고 회사의 안내가 있는 경우에는 그에 따라야 합니다.
          </p>
          <p>
            2. 회원은 회사의 사전 승낙 없이는 서비스를 이용한 영업 활동을 할 수 없으며, 영업 활동의 결과와 회원이 약관에 위반한 영업 활동을 이용하여 발생한 결과에 대하여 회사는 책임을 지지 않습니다. 회원은 이와 같은 영업 활동으로 인하여 회사가 손해를 입은 경우 이를 배상하여야 합니다.
          </p>
          <p>
            3. 회원은 서비스를 이용할 때 다음과 같은 행위를 하여서는 안 됩니다.
            <ul className="list-disc list-inside mt-2">
            <li>타인의 개인정보, ID(이메일 주소)와 비밀번호 등 서비스 이용 정보, 금융 정보 등을 도용하는 행위</li>
              <li>서비스에서 얻은 정보를 회원의 개인적 이용 이외의 목적으로 복제하거나 출판 및 방송 등에 사용하거나 제3자에게 제공하는 행위</li>
              <li>기타 법령에 위배되는 행위</li>
            </ul>
          </p>

          <h4 className="font-bold">제9조 게시물의 관리</h4>
          <p>
          1. 회원이 관련 법령, 본 약관, 계정 및 게시물 운영 정책 등을 준수하지 않을 경우, 회사는 회원의 관련 행위 내용을 확인할 수 있으며, 확인 결과에 따라 서비스 이용에 대한 주의를 당부하거나, 서비스 이용을 일부 또는 전부, 일시 또는 영구히 정지시키는 등 이용을 제한할 수 있습니다.
          </p>
          <p>
            2. 회사는 다음에 해당하는 경우 회원의 게시물을 사전 통지 없이 비공개 또는 삭제 처리하거나 게재를 거부할 수 있습니다.
            <ul className="list-disc list-inside mt-2">
              <li>타인의 ID(이메일 주소), 비밀번호, 이메일 주소, 휴대폰 번호를 도용하는 경우</li>
              <li>타인의 저작권 등 권리를 침해하는 내용인 경우</li>
              <li>타인의 명예를 훼손하거나 불이익을 주는 경우</li>
              <li>영리를 목적으로 하는 광고일 경우</li>
              <li>회사에서 규정한 게시물 원칙에 어긋나거나, 게시판의 성격에 부합하지 않는 게시물일 경우</li>
              <li>기타 관계 법령에 위배되는 경우</li>
            </ul>
          </p>

          <h4 className="font-bold">제10조 정보의 제공</h4>
          <p>
          회사는 회원이 서비스 이용 중 꼭 알아야 할 필요가 있는 정보를 공지 사항이나 전자우편 등의 방법으로 회원에게 제공할 수 있습니다.
          </p>

          <h4 className="font-bold">제11조 이용 계약의 변경 및 해지</h4>
          <p>
          1. 회원이 이용 계약을 해지하고자 하는 때에는 회원 본인이 온라인 또는 기타 방법을 통하여 회사에 해지 신청을 해야 합니다.
          </p>
          <p>
          2. 회원은 이용 계약을 해지하고자 하는 때에는 회사의 영업 시간 이외에도 온라인 또는 기타 방법을 통하여 회사에 해지 신청을 할 수 있습니다.
          </p>
          <p>
          3. 회사는 회원이 본 약관 제5조와 제8조의 각 호에 해당하는 행위를 하였을 경우 사전 통지 없이 이용 계약을 해지하거나 또는 기간을 정하여 서비스 이용을 중지할 수 있습니다.
          </p>

          <h4 className="font-bold">제12조 개인정보의 변경</h4>
          <p>
          회원은 이용 신청 시 기재한 개인정보가 변경되었을 경우에는 이를 수정해야 하며, 미변경으로 인한 책임은 회원에게 있습니다.
          </p>

          <h4 className="font-bold">제13조 서비스 이용 범위</h4>
          <p>
            1. 회원은 서비스 이용 시 회사가 지정한 지불 방법으로 구매한 서비스만 이용할 수 있습니다.
          </p>
          <p>
            2. 회사가 제공하는 서비스는 명의자 본인에 한하여 이용할 수 있으며, 제3자로의 복제, 전송, 배포는 금지됩니다.
          </p>
          <p>
          3. 회사가 회원에게 제공하는 서비스 및 정보는 자기 자산의 관리 또는 투자가 아닌, 영리를 추구하기 위하여 가공, 활용 또는 제3자에게 제공하기 위한 목적으로 사용할 수 없습니다.
          </p>
          <p>
          4. 회사가 회원에게 제공하는 서비스 및 정보의 내용을 특정 거래나 투자 행위를 함에 있어 보증된 사항인 것과 같이 활용 및 제공하기 위한 목적으로 사용할 수 없습니다.
          </p>

          <h4 className="font-bold">제14조 요금 및 유료 정보</h4>
          <p>
          1. 회사에서 정한 별도의 유료 정보 및 서비스 이용에 대해서는 해당 정보 및 서비스에 명시된 요금을 지불해야 사용이 가능합니다.
          </p>
          <p>
          2. 회사의 유료 정보 및 서비스는 전자상거래 등에서의 소비자보호에 관한 법률 제17조 제2항 제5호에 따라 청약 철회 및 계약의 해제가 불가능한 상품입니다. 단, 회사가 정상적인 서비스를 제공할 수 없는 경우 회원은 이용 계약을 해지할 수 있습니다.
          </p>

          <h4 className="font-bold">제15조 결제 방법</h4>
          <p>
            1. 서비스 결제는 회사가 정한 방법을 통하여 이용자가 직접 지불할 수 있습니다.
          </p>
          <p>
            2. 회원은 회사가 정한 대금 지급 방법(신용카드 등)으로 결제할 수 있습니다.
          </p>
          <p>
            3. 자동 납부의 경우 별도 해지 신청이 없을 경우 최초 결제일을 기준으로 매월 신청한 방법(신용카드 등)으로 자동 결제됩니다.
          </p>

          <h4 className="font-bold">제16조 유료 서비스 이용</h4>
          <p>
          1. 회사가 운영하는 유료 서비스 및 디지털 콘텐츠는 회사가 정한 범위 내에서 본인이 직접 이용하는 것으로 한정합니다. 이를 초과하는 이용 방법은 영리 또는 비영리를 구분하지 않고 엄격히 금지되며, 제3자로의 일체의 복제, 전송, 배포는 금지됩니다.
          </p>
          <p>
          2. 회사의 중대한 과실에 의하여 콘텐츠가 손상, 훼손, 삭제되었거나 서비스 이용이 불가능할 경우, 전액 환불이 가능합니다.
          </p>
          <p>
          3. 약관에 규정되지 않은 유료 서비스의 이용과 취소, 환불에 관한 규정은 전자상거래 등에서의 소비자보호에 관한 법률 등 관련 법령이 정한 바에 따릅니다.
          </p>

          <h4 className="font-bold">제17조 취소 및 환불</h4>
          <p>
            1. 구매한 뒤 이용하지 않은 콘텐츠, 멤버십, 이용권은 결제일로부터 7일 이내에 요청하시면 전액 환불이 가능합니다. 단, 다음의 경우에는 환불을 요청할 수 없습니다.
            <ul className="list-disc list-inside mt-2">
              <li>구입한 디지털 콘텐츠를 다운로드 또는 실시간 스트리밍 서비스를 통해 열어 본 경우</li>
              <li>멤버십 가입 후 디지털 콘텐츠를 다운로드 또는 실시간 스트리밍 서비스를 통해 열어 본 경우</li>
              <li>이용권 구매자 또는 수신자가 사이트에서 이용권을 등록한 경우</li>
              <li>타사에서 결제 후, 동일 콘텐츠 결제에 대해 회사에 환불을 요청하는 경우</li>
              <li>서비스 업데이트를 통한 문제 해결이 가능함에도 회원의 의사로 이를 거부하여 서비스를 이용하지 못하는 경우</li>
              <li>회원의 실수로 해당 서비스를 이용하지 못하는 경우</li>
              <li>구매 시 환불 불가로 안내된 상품</li>
            </ul>
          </p>

          <p>
          2. 구매한 뒤 이용한 멤버십은 유형에 따라 회원의 의사로 해지가 가능합니다.
            <ul className="list-disc list-inside mt-2">
              <li>월 정기 결제를 통한 멤버십: 해지 후에도 최종 결제일로부터 1개월이 되는 날까지는 멤버십이 유지되며, 해당일이 종료됨과 동시에 멤버십과 정기 납부가 해제됨</li>
              <div>◦예시: 2024년 9월 1일 월 정기 결제 멤버십 가입 후 2024년 9월 15일 해제: 2024년 9월 31일까지 멤버십 유지 후 정기 납부 해제</div>
              <li>3개월 이상 구독을 통한 멤버십: 해지 시 결제일 이후 1개월까지 멤버십이 유지되며, 그 이후의 남은 잔여 기간에 대해 정산하여 해당 금액을 환불함</li>
              <div>◦예시: 2024년 9월 1일 6개월 구독 멤버십 가입 후 가입 후 2024년 10월 15일 해제: (6개월 구독료 30,000원 기준) 10월 31일까지 멤버십 유지 후 이용기간 2개월 분의 구독료를 제외한 10,000원 환불</div>
              <li>이용한 결제 수단에 따라 아래와 같이 환불되며, 해당 수단으로의 환불이 어려운 경우 사전 안내 후 협의에 따라 진행 ※ 계좌 이체: 제수수료를 제외한 금액을 지정계좌로 환불 ※ 신용카드: 매입 이전(전체 또는 부분 취소 환불)※ 신용카드: 매입 이후(제수수료를 제외한 금액을 지정계좌로 환불)</li>

            </ul>
          </p>

          <p>
          3. 일정 기간 또는 특정일에 온/오프라인에서 진행되는 교육 상품의 경우, 본조 1항의 취소, 환불 규정이 아닌 아래와 같은 별도의 환불 기준에 따릅니다.
            <ul className="list-disc list-inside mt-2">
              <div>(1) 「학원의 설립·운영 및 과외교습에 관한 법률」 제18조제1항 및 「학원의 설립·운영 및 과외교습에 관한 법률 시행령」 제18조 제2항에 열거된 사유의 발생 시에는 동 시행령 반환기준에 따릅니다.</div>
              <div>(2) 회사의 귀책사유로 인하여 계약을 해제 또는 해지하는 경우에는 「소비자분쟁해결기준」(공정거래위원회 고시 제) [별표2] 61호의 기준에 따릅니다.</div>
              <div>(3) 소비자의 귀책사유로 인하여 계약을 해제 또는 해지하는 경우에는 다음의 기준에 따릅니다.</div>
              <li>교습개시 이전 수강자의 귀책사유로 계약을 해제하는 경우: 기 납부한 수강료 전액 환급</li>
              <li>교습개시 이후 수강자의 귀책사유로 계약을 해지하는 경우- 총 교습시간의 1/3 경과 전: 수강료의 2/3 해당액 환급 - 총 교습시간의 1/2 경과 전: 수강료의 1/2 해당액 환급 - 총 교습시간의 1/2 경과 후: 환급하지 않음</li>
              <div>(4) 수강료 환불 관련 주의 사항</div>
              <li>수강료에 대한 환불 의사를 표시하지 아니하고 무단결석 시 이는 교습이 진행된 시간으로 간주되며, 환불은 명백한 환불의사를 표시한 시점을 기준으로 이루어집니다.</li>
              <li>계좌 이체를 통한 결제 환불의 경우는 제수수료를 제외한 금액을 지정계좌로 환불합니다.</li>
              <li>신용카드를 통한 결제 환불의 경우는 제수수료를 제한 금액을 지정계좌로 환불합니다.</li>
              <div>◦예시: 총 12강, 매주 오후 7시, 3시간, 수업료 120만 원인 경우,- 첫 강의일 이전 환불할 경우: 수강료 전액 환불 = 120만 원 환급- 총 강의 수의 1/3(5강 강의일 오후 7시 이전) 경과 전 환불할 경우: 수강료의 2/3 해당액 환급 = 80만 원 환불 가능- 총 강의 수의 1/2(7강 강의일 오후 7시 이전) 경과 전 환불할 경우: 수강료의 1/2 해당액 환급 = 60만 원 환불 가능- 총 강의 수의 1/2(7강 강의일 오후 7시 이후) 경과 후 환불할 경우: 환불하지 않음</div>
              <div>※ 환불의사를 밝힌 이메일, 문자, 카카오톡 메시지 등(환불 상담/문의 등이 아닌 명확한 환불 의사가 포함된 내용)의 수신 시간을 기준으로 환불 규정이 적용됩니다.</div>
              <div>※ 계좌 이체를 통한 결제의 경우 환불 신청 후 3영업일 내로 환불이 완료됩니다.</div>
              <div>※ 카드 결제 건은 전체/부분 취소로 진행되며, 매입이 완료되어 전체/부분 취소가 어려울 시 환급액에서 카드결제 수수료를 제외한 금액을 지정 계좌로 환불합니다.</div>
              <div>※ 카드 결제의 경우 카드사 사정에 따라 최대 3~7 영업일까지 소요될 수 있으며, 정확한 취소처리 상황은 해당 카드사에 문의하시면 정확한 안내를 받으실 수 있습니다.</div>
            </ul>
          </p>

          <p>
          4. 회사는 과오금이 발생한 경우 이용 대금의 결제와 동일한 방법으로 과오금 전액을 환불합니다. 단, 동일한 방법으로 환불이 불가능할 경우에는 사전에 고지합니다.
          </p>

          <p>
          5. 회사에게 책임있는 사유로 과오금이 발생한 경우 회사는 계약 비용, 수수료 등에 관계없이 과오금 전액을 환불합니다. 단, 회원에게 책임있는 사유로 과오금이 발생한 경우에는 회사가 과오금을 환불하는 데 소요되는 비용은 회원이 합리적인 범위 내에서 부담합니다.
          </p>


          <h4 className="font-bold">제18조 분쟁의 해결</h4>
          <p>
          본 약관에 명시되지 아니한 사항 또는 약관 해석상 다툼이 있는 경우에는 회원은 언제든지 회사가 운영하는 상담 채널을 통해 회사와 합의하여 해결할 수 있고, 합의가 이루어지지 아니한 경우에는 관계 법령 및 일반 상관례에 따릅니다.
          </p>

          <h4 className="font-bold">제19조 합의 관할</h4>
          <p>
          회원은 회원의 주소지를 관할하는 법원 이외에 회사의 본점 사무소를 관할하는 법원을 별도의 합의 관할로 하는 데 동의합니다.
          </p>

          <h4 className="font-bold">부칙</h4>
          <p>
            이 약관은 2024년 9월 1일부터 시행됩니다.
          </p>
        </div>
      </div>
    </div>
  );
};

export default ServiceModal;